---
kind: property
id: P:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnSecondCurve
source: html/11c56a03-b8bd-2233-7fe8-fe3901741466.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.XYZPointOnSecondCurve Property

Point on the second curve in 3d coordinates.

## Syntax (C#)
```csharp
public XYZ XYZPointOnSecondCurve { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The property has not been set by the method providing the result.